# Reading JSON w/ Pandas

## Simple JSON

In [6]:
import pandas as pd

a_dict = {
    'school': 'ABC primary school',
    'location': 'London',
    'ranking': 2,
}
df = pd.json_normalize(a_dict)
df

               school location  ranking
0  ABC primary school   London        2

## List of Dictionaries

In [7]:
json_list = [
    { 'class': 'Year 1', 'student number': 20, 'room': 'Yellow' },
    { 'class': 'Year 2', 'student number': 25, 'room': 'Blue' },
]
pd.json_normalize(json_list)

    class  student number    room
0  Year 1              20  Yellow
1  Year 2              25    Blue

In [8]:
json_list = [
    { 'class': 'Year 1', 'num_of_students': 20, 'room': 'Yellow' },
    { 'class': 'Year 2', 'room': 'Blue' }, # no num_of_students
]
pd.json_normalize(json_list)

    class  num_of_students    room
0  Year 1             20.0  Yellow
1  Year 2              NaN    Blue

## Flattening Multi-Level JSON

In [9]:
json_obj = {
    'school': 'ABC primary school',
    'location': 'London',
    'ranking': 2,
    'info': {
        'president': 'John Kasich',
        'contacts': {
          'email': {
              'admission': 'admission@abc.com',
              'general': 'info@abc.com'
          },
          'tel': '123456789',
      }
    }
}
pd.json_normalize(json_obj)

,school,location,ranking,info.president,info.contacts.email.admission,info.contacts.email.general,info.contacts.tel
0,ABC primary school,London,2,John Kasich,admission@abc.com,info@abc.com,123456789

In [10]:
pd.json_normalize(json_obj, max_level=1)

,school,location,ranking,info.president,info.contacts
0,ABC primary school,London,2,John Kasich,"{'email': {'admission': 'admission@abc.com', '..."

## List of Dictionaries

In [11]:
json_list = [
    { 
        'class': 'Year 1', 
        'student count': 20, 
        'room': 'Yellow',
        'info': {
            'teachers': { 
                'math': 'Rick Scott', 
                'physics': 'Elon Mask' 
            }
        }
    },
    { 
        'class': 'Year 2', 
        'student count': 25, 
        'room': 'Blue',
        'info': {
            'teachers': { 
                'math': 'Alan Turing', 
                'physics': 'Albert Einstein' 
            }
        }
    },
]
pd.json_normalize(json_list)

    class  student count    room info.teachers.math info.teachers.physics
0  Year 1             20  Yellow         Rick Scott             Elon Mask
1  Year 2             25    Blue        Alan Turing       Albert Einstein

In [12]:
pd.json_normalize(json_list, max_level=1)

,class,student count,room,info.teachers
0,Year 1,20,Yellow,"{'math': 'Rick Scott', 'physics': 'Elon Mask'}"
1,Year 2,25,Blue,"{'math': 'Alan Turing', 'physics': 'Albert Ein..."

## Nested Lists

In [13]:
json_obj = {
    'school': 'ABC primary school',
    'location': 'London',
    'ranking': 2,
    'info': {
        'president': 'John Kasich',
        'contacts': {
          'email': {
              'admission': 'admission@abc.com',
              'general': 'info@abc.com'
          },
          'tel': '123456789',
      }
    },
    'students': [
      { 'name': 'Tom' },
      { 'name': 'James' },
      { 'name': 'Jacqueline' }
    ],
}
pd.json_normalize(json_obj)

,school,location,ranking,students,info.president,info.contacts.email.admission,info.contacts.email.general,info.contacts.tel
0,ABC primary school,London,2,"[{'name': 'Tom'}, {'name': 'James'}, {'name': ...",John Kasich,admission@abc.com,info@abc.com,123456789

In [14]:
# Flatten students
pd.json_normalize(json_obj, record_path=['students'])

         name
0         Tom
1       James
2  Jacqueline

## API for Classes Example

In [17]:
my_json="courses.json"
import pandas as pd

df=pd.json_normalize(my_j)#son,record_path='items')

NameError: name 'my_j' is not defined

In [5]:
csv_file = df.to_csv("json_test.csv")

In [6]:
df

,semesterLength,semester,categories,courseCode,periodsAvailable,level,subcategories,location,description,dualCreditDailySchedule
0,Dual semester,1,Business & Industry,AG1AA,[[3]],On Level,"Agriculture, Food & Natural Resources",AHS,Advanced Animal Science (AG1AA),NaN
1,Dual semester,2,Business & Industry,AG1AA,[[3]],On Level,"Agriculture, Food & Natural Resources",AHS,Advanced Animal Science (AG1AA),NaN
2,Single semester,1,Business & Industry,AG1EQ,[[2]],On Level,"Agriculture, Food & Natural Resources",AHS,Equine Science (AG1EQ),NaN
3,Single semester,2,Business & Industry,AG1EQ,[[2]],On Level,"Agriculture, Food & Natural Resources",AHS,Equine Science (AG1EQ),NaN
4,Dual semester,1,Business & Industry,AG1FL,"[[3], [6], [7]]",On Level,"Agriculture, Food & Natural Resources",AHS,Floral Design (AG1FL),NaN
...,...,...,...,...,...,...,...,...,...,...
689,Dual semester,1,NaN,LY9E2,[[1]],NaN,NaN,AHS,English II Applied (LY9E2),NaN
690,Dual semester,2,NaN,LY9E2,[[1]],NaN,NaN,AHS,English II Applied (LY9E2),NaN
691,Dual semester,1,NaN,LY9E3,[[1]],NaN,NaN,AHS,English III Applied (LY9E3),NaN
692,Dual semester,2,NaN,LY9E3,[[1]],NaN,NaN,AHS,English III Applied (LY9E3),NaN
693,Dual semester,1,NaN,LY9E4,[[1]],NaN,NaN,AHS,English IV Applied (LY9E4),NaN

In [13]:
html_table=df.to_html()

In [14]:
with open ('test.html','w') as file:
    file.write('<html>')
    file.write('<head>')
    file.write('<link rel="stylesheet" href="APItest.css">')
    file.write('</head>')
    file.write('<body>')
    file.write(html_table)
    file.write('</body>')
    file.write('</html>')